---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SelectionUIOptions Properties
SelectionUIOptions Class See Also Send Feedback
---

The SelectionUIOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ActivateControlsAndDimensionsOnMultiSelect | Indicates whether controls and temporary dimensions are activated on selection of multiple elements. |
|  | DragOnSelection | Indicates whether elements can be dragged immediately when they are selected. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SelectFaces | Indicates whether elements can be selected by clicking on the interior of a face. |
|  | SelectLinks | Indicates whether Revit and CAD link instances can be selected. |
|  | SelectPinned | Indicates whether pinned elements can be selected. |
|  | SelectUnderlay | Indicates whether elements that are displayed as underlay can be selected. |

# See Also

SelectionUIOptions Class

Autodesk.Revit.UI Namespace